Tekla Open API Reference for Tekla Structures 2025
DrawingObjectSelector.UnselectAllObjects Method
 Unselects all the selected objects.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UnselectAllObjects()
Public Function UnselectAllObjects As Boolean
Return Value
Type: Boolean
True if succeeded.
See Also
Reference
DrawingObjectSelector Class
Tekla.Structures.Drawing.UI Namespace